InformationRegisters/КР_ОшибкиПоискаДанныхИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ОшибкиПоискаДанныхИнтеграции</Name>
			<Comment>JIRA№ A2105505-1402</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХэшИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ОшибкиПоискаДанныхИнтеграции/Ext/ManagerModule.bsl
////////////////////////////////////////////////////
//// Модуль менеджера регистра сведений "КР_ОшибкиПоискаДанныхИнтеграции"
//// Создан: 13.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1402

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(ОшибкаПоиска, СообщениеОбмена) Экспорт 
	
	// Инициализация переменных
	ОбъектМетаданных = ОшибкаПоиска.ОбъектМетаданных;
 	ТекстСообщения = ОшибкаПоиска.ТекстСообщения;   
	ИсходныеДанные = Неопределено;
	ОшибкаПоиска.Свойство("ИсходныеДанные", ИсходныеДанные);

	Отправитель = СообщениеОбмена.Отправитель; 
	КлючСообщения = СообщениеОбмена.КлючСообщения;
    //
	
	// Исходные данные надо сериализовать исходя из их типа
	Если ИсходныеДанные = Неопределено Тогда 
		УточнениеУникальности = ТекстСообщения;	
	ИначеЕсли ТипЗнч(ИсходныеДанные) = Тип("ОбъектXDTO") Тогда 
		СериализованныеИсходныеДанные = КР_ФункцииРаботыJSON.СериализоватьXDTOВJSON(ИсходныеДанные);   
		УточнениеУникальности = СериализованныеИсходныеДанные;	
	Иначе                          
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON;
		СериализованныеИсходныеДанные = КР_ОбщегоНазначениеСервер.ДанныеВJSON(ИсходныеДанные, ПараметрыЗаписиJSON);   
		УточнениеУникальности = СериализованныеИсходныеДанные;	
	КонецЕсли;		
	
	ОбъектМетаданныхПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	ДанныеКлючаУникальности = ОбъектМетаданныхПолноеИмя + XMLСтрока(Отправитель) + УточнениеУникальности;
		
	ХэшИдентификаторЗаписи = КР_ОбщегоНазначениеСервер.MD5(ДанныеКлючаУникальности);	
	
	Запись = РегистрыСведений.КР_ОшибкиПоискаДанныхИнтеграции.СоздатьМенеджерЗаписи();
	Запись.ХэшИдентификаторЗаписи = ХэшИдентификаторЗаписи;  
	Запись.Прочитать();

	Если Запись.Выбран() Тогда 
		Возврат;
	КонецЕсли;
	
	Запись.ХэшИдентификаторЗаписи = ХэшИдентификаторЗаписи;  
	Запись.Отправитель = Отправитель;
	Запись.ОбъектМетаданных = ОбъектМетаданныхПолноеИмя;
	Запись.ТекстСообщения = ТекстСообщения;    
	
	Запись.ПериодЗаписи = ТекущаяДатаСеанса();
	Запись.КлючСообщения = КлючСообщения;
	Запись.ИсходныеДанные = СериализованныеИсходныеДанные;   
	
	Запись.Записать();
		
КонецПроцедуры	

#КонецОбласти

#Область СервисныеМетоды

#КонецОбласти

#КонецЕсли
